app/Services/DesignationService.php

select * from `designations` where `status_id` = 1
---
    public function get()
    {
        return DB::table('designations')->where('status_id',1)->get();